{
  "summaries": {
    "Root": "ルートエンドポイント",
    "Health Check": "ヘルスチェック",
    "Create Tenant": "テナント作成",
    "Get Tenant": "テナント取得",
    "Update Tenant": "テナント更新",
    "Delete Tenant": "テナント削除",
    "Add Store": "店舗追加",
    "Get Store": "店舗取得",
    "Get Stores": "店舗一覧取得",
    "Update Store": "店舗更新",
    "Delete Store": "店舗削除",
    "Create Terminal": "端末作成",
    "Get Terminal": "端末取得",
    "Get Terminals": "端末一覧取得",
    "Delete Terminal": "端末削除",
    "Update Terminal Description": "端末説明更新",
    "Update Terminal Function Mode": "端末機能モード更新",
    "Terminal Open": "端末開店",
    "Terminal Close": "端末閉店",
    "Terminal Cash In": "現金入金",
    "Terminal Cash Out": "現金出金",
    "Terminal Signin": "スタッフサインイン",
    "Terminal Signout": "スタッフサインアウト",
    "Notify Delivery Status": "配信状態通知",
    "Create Cart": "カート作成",
    "Get Cart": "カート取得",
    "Add Items": "商品追加",
    "Cancel Line Item": "明細取消",
    "Update Item Quantity": "数量変更",
    "Update Item Unit Price": "単価変更",
    "Add Discount To Line Item": "明細値引追加",
    "Discount To Cart": "カート値引追加",
    "Subtotal": "小計",
    "Payments": "支払処理",
    "Bill": "会計完了",
    "Cancel Transaction": "取引取消",
    "Resume Item Entry": "商品入力再開",
    "Clear terminal cache": "端末キャッシュクリア",
    "Get terminal cache status": "端末キャッシュ状態取得",
    "Get Transactions By Query": "取引検索",
    "Get Transaction By Tranasction No": "取引番号で取得",
    "Return Transaction By Transaction No": "返品処理",
    "Void Transaction By Transaction No": "取消処理",
    "Update Delivery Status": "配信状態更新",
    "Create Staff Master Async": "スタッフマスター作成",
    "Get Staff Master Async": "スタッフマスター取得",
    "Get Staff Master All Async": "スタッフマスター一覧取得",
    "Update Staff Master Async": "スタッフマスター更新",
    "Delete Staff Master Async": "スタッフマスター削除",
    "Create Item Master Async": "商品マスター作成",
    "Get Item Master Async": "商品マスター取得",
    "Get Item Master All Async": "商品マスター一覧取得",
    "Update Item Master Async": "商品マスター更新",
    "Delete Item Master Async": "商品マスター削除",
    "Get Item Store Master Async": "店舗別商品マスター取得",
    "Get Item Store Master All Async": "店舗別商品マスター一覧取得",
    "Get Item Store Master Detail Async": "店舗別商品マスター詳細取得",
    "Update Item Store Master Async": "店舗別商品マスター更新",
    "Delete Item Store Master Async": "店舗別商品マスター削除",
    "Create Item Book": "商品ブック作成",
    "Get All Item Books": "商品ブック一覧取得",
    "Get Item Book By Id": "商品ブック取得",
    "Get Item Book Detail By Id": "商品ブック詳細取得",
    "Update Item Book": "商品ブック更新",
    "Delete Item Book": "商品ブック削除",
    "Add Category To Item Book": "商品ブックにカテゴリー追加",
    "Update Category In Item Book": "商品ブック内カテゴリー更新",
    "Delete Category From Item Book": "商品ブックからカテゴリー削除",
    "Add Tab To Category In Item Book": "商品ブック内カテゴリーにタブ追加",
    "Update Tab In Category In Item Book": "商品ブック内カテゴリーのタブ更新",
    "Delete Tab From Category In Item Book": "商品ブック内カテゴリーからタブ削除",
    "Add Button To Tab In Category In Item Book": "商品ブック内タブにボタン追加",
    "Update Button In Tab In Category In Item Book": "商品ブック内タブのボタン更新",
    "Delete Button From Tab In Category In Item Book": "商品ブック内タブからボタン削除",
    "Create Payment": "支払方法作成",
    "Get All Payments": "支払方法一覧取得",
    "Get Payment": "支払方法取得",
    "Update Payment": "支払方法更新",
    "Delete Payment": "支払方法削除",
    "Get Taxes": "税率一覧取得",
    "Get Tax": "税率取得",
    "Create Category": "カテゴリー作成",
    "Get Categories": "カテゴリー一覧取得",
    "Get Category": "カテゴリー取得",
    "Update Category": "カテゴリー更新",
    "Delete Category": "カテゴリー削除",
    "Create Settings Master Async": "設定マスター作成",
    "Get Settings Master Async": "設定マスター一覧取得",
    "Get Settings Master By Name Async": "設定マスター取得",
    "Get Settings Value By Name Async": "設定値取得",
    "Update Settings Master Async": "設定マスター更新",
    "Delete Settings Master Async": "設定マスター削除",
    "Get Report For Store": "店舗レポート取得",
    "Get Report For Terminal": "端末レポート取得",
    "Receive Transactions": "取引データ受信",
    "Handle Tranlog": "取引ログ処理",
    "Handle Cashlog": "現金ログ処理",
    "Handle Opencloselog": "開閉店ログ処理",
    "Handle transaction log from cart service": "カートサービスから取引ログ受信",
    "Get Journals": "ジャーナル一覧取得",
    "Receive Journals": "ジャーナルデータ受信",
    "Get stock list for a store": "店舗在庫一覧取得",
    "Get stock for an item": "商品在庫取得",
    "Get low stock items": "在庫僅少商品取得",
    "Get reorder alert items": "発注点アラート取得",
    "Update stock quantity": "在庫数更新",
    "Set minimum stock quantity": "最小在庫数設定",
    "Set reorder parameters": "発注点パラメータ設定",
    "Get stock update history with filtering": "在庫更新履歴取得",
    "Create stock snapshot": "在庫スナップショット作成",
    "Get stock snapshots with flexible date filtering": "在庫スナップショット一覧取得",
    "Get stock snapshot by ID": "在庫スナップショット取得",
    "Get snapshot schedule configuration": "スナップショットスケジュール設定取得",
    "Update snapshot schedule configuration": "スナップショットスケジュール設定更新",
    "Delete snapshot schedule configuration": "スナップショットスケジュール設定削除",
    "Login For Access Token": "アクセストークン取得",
    "Register Super User": "スーパーユーザー登録",
    "Register User By Superuser": "ユーザー登録"
  },
  "descriptions": {
    "Authenticate user and provide a JWT access token\n\nThe client_id field in the form is used as the tenant_id for multi-tenant support": "ユーザーを認証し、JWTアクセストークンを発行します。",
    "Register a new superuser and create a new tenant\n\nThis endpoint is used for initial setup of a tenant and its admin user": "スーパーユーザーを登録し、新しいテナントを作成します。",
    "Register a new regular user in the tenant by a superuser\n\nThis endpoint is protected and can only be called by authenticated superusers": "スーパーユーザーを登録し、新しいテナントを作成します。",
    "Root endpoint that returns a welcome message.\nUseful for health checks and API verification.": "ルートエンドポイントです。ウェルカムメッセージとAPI情報を返します。",
    "Health check endpoint for monitoring service health.": "ヘルスチェックエンドポイントです。サービスの稼働状態を監視します。",
    "Create a new shopping cart.\n\nInitializes a new cart for the current terminal with optional user information\nand transaction type.": "新しいショッピングカートを作成します。現在の端末に対して、オプションのユーザー情報を含む新しいカートを初期化します。",
    "Retrieve a cart by its ID.\n\nFetches the cart with the specified ID and returns its full details.": "カートを取得します。指定されたカートの詳細情報を返します。",
    "Cancel a transaction/cart.\n\nMarks the cart as cancelled, preventing further modifications or processing.": "取引を取消します。カートを取消状態にし、以降の処理を防止します。",
    "Add items to a cart.\n\nAdds one or more items to the specified cart.": "カートに商品を追加します。",
    "Cancel a specific line item in a cart.\n\nMarks the specified line item as cancelled without removing it from the cart.": "明細を取消します。指定された明細を取消状態にします。",
    "Update the unit price of a cart line item.\n\nChanges the unit price of the specified item in the cart.": "単価を更新します。指定された明細の単価を変更します。",
    "Update the quantity of a cart line item.\n\nChanges the quantity of the specified item in the cart.": "数量を更新します。指定された明細の数量を変更します。",
    "Add discount to a specific line item in a cart.\n\nApplies one or more discounts to the specified item in the cart.": "カートに商品を追加します。",
    "Calculate the subtotal for a cart.\n\nUpdates the cart with calculated subtotals and tax information.": "小計を計算します。カートの小計と税金情報を計算して更新します。",
    "Add discount to the entire cart.\n\nApplies one or more discounts at the cart level, affecting the total price.": "Add discount to the entire cart.\n\nApplies one or more discounts at the cart level, affecting the total price.",
    "Add payments to a cart.\n\nProcesses one or more payment methods against the cart.": "Add payments to a cart.\n\nProcesses one or more payment methods against the cart.",
    "Finalize a cart into a billable transaction.\n\nCompletes the cart processing, finalizing the transaction and preparing\nit for receipt generation and storage.": "会計を完了します。支払処理を完了し、取引レコードとレシートを生成します。",
    "Resume item entry from paying state.\n\nTransitions the cart from Paying state back to EnteringItem state,\nclearing any payment information and allowing additional items to be added.": "商品入力を再開します。支払状態から商品入力状態に戻します。",
    "Get transactions based on query parameters.\n\nRetrieves a paginated list of transactions matching the specified filters.\nThe tenant ID in the path must match the tenant ID from the authentication token.": "取引を取得します。指定された条件に一致する取引情報を返します。",
    "Get a single transaction by its transaction number.\n\nRetrieves detailed information about a specific transaction identified by its number.\nThe tenant ID in the path must match the tenant ID from the authentication token.": "取引を取得します。指定された条件に一致する取引情報を返します。",
    "Void (cancel) a transaction.\n\nMarks a transaction as voided and processes any required refund payments.\nThe terminal making this request must match the terminal that created the transaction.": "取引を取消（無効化）します。取引を取消状態にし、取消レコードを作成します。",
    "Process a transaction return.\n\nCreates a return transaction based on an original transaction and processes any required refund payments.\nThe terminal making this request must be in the same store as the original transaction.": "返品を処理します。元の取引に対する返品取引を作成します。",
    "Notify the delivery status of a transaction.\n\nUpdates the delivery status of a specific transaction based on the provided information.\nThe terminal making this request must be in the same store as the original transaction.": "配信状態を通知します。取引の配信状態を更新します。",
    "Create a new tenant with the specified tenant ID.\n\nThis endpoint sets up the necessary database collections and indexes for a new tenant.\nThe tenant ID in the request body must match the tenant ID extracted from the authentication token.": "新しいテナントを作成します。必要なデータベースコレクションとインデックスをセットアップします。",
    "Get current status of the terminal information cache": "端末キャッシュの状態を取得します。キャッシュされたデータと最終更新時刻を返します。",
    "Clear all entries from the terminal information cache": "端末キャッシュをクリアします。キャッシュされたデータを削除します。",
    "Root endpoint that returns a welcome message and API version information.": "ルートエンドポイントです。ウェルカムメッセージとAPI情報を返します。",
    "Create a new journal entry.\n\nThis endpoint allows terminals to submit journal entries for storage and later retrieval.\nJournal entries represent receipts, cash operations, and other terminal activities.\n\nAuthentication is required via token or API key. The tenant ID in the path must match\nthe one in the security credentials.": "ジャーナルデータを受信します。端末からのジャーナルエントリを処理します。",
    "Retrieve journal entries with various filtering options.\n\nThis endpoint provides a flexible search interface for journal entries, allowing\nfiltering by terminal, transaction type, date ranges, receipt numbers, and keywords.\nResults can be paginated and sorted.\n\nAuthentication is required via token or API key. The tenant ID in the path must match\nthe one in the security credentials.": "ジャーナルエントリを取得します。フィルタリング付きのジャーナルレコードを返します。",
    "Setup the database for the tenant. This will create the required collections and indexes.": "新しいテナントを作成します。必要なデータベースコレクションとインデックスをセットアップします。",
    "Handle transaction logs received via Dapr pub/sub.\n\nThis endpoint is called by Dapr when a transaction log message is published\nto the 'topic-tranlog' topic. It processes the transaction data and generates\nthe corresponding journal entries.\n\nThe journal service uses this data to create human-readable receipt text\nand maintains a searchable record of all transactions.": "取引ログを処理します。Dapr pub/sub経由で受信した取引ログイベントを処理します。",
    "Handle cash in/out logs received via Dapr pub/sub.\n\nThis endpoint is called by Dapr when a cash log message is published\nto the 'topic-cashlog' topic. It processes the cash movement data and\ngenerates the corresponding journal entries.\n\nCash logs represent non-sales cash movements like float, paid-ins, and payouts.": "入出金ログを処理します。Dapr pub/sub経由で受信した入出金イベントを処理します。",
    "Handle terminal open/close logs received via Dapr pub/sub.\n\nThis endpoint is called by Dapr when an open/close log message is published\nto the 'topic-opencloselog' topic. It processes the terminal session data\nand generates the corresponding journal entries.\n\nThese logs mark the beginning and end of a terminal's business session\nand include details like starting cash, ending cash, and reconciliation.": "開閉店ログを処理します。Dapr pub/sub経由で受信した端末状態変更イベントを処理します。",
    "Direct API endpoint for receiving transaction data.\n\nThis endpoint can be used as an alternative to the Dapr pub/sub mechanism\nwhen direct REST API calls are preferred. It requires authentication via\ntoken or API key.\n\nThe function validates the tenant ID from the security credentials,\nprocesses the transaction data, and generates the corresponding journal entries.": "取引データを受信します。カートサービスからの取引データを処理します。",
    "Define Dapr pub/sub subscriptions for this service.\n\nThis endpoint is called by Dapr during startup to determine which pub/sub topics\nthis service should subscribe to. When a message is published to one of these topics,\nDapr will deliver it to the specified route.\n\nThe journal service subscribes to transaction logs, cash logs, and open/close logs\nto generate and store journal entries for each operation.": "Dapr pub/subサブスクリプションを定義します。このサービスがサブスクライブするトピックを設定します。",
    "Create a new staff record in the master data.\n\nThis endpoint allows creating a new staff member with their ID, name, PIN code,\nand assigned roles. Staff records are essential for authentication, authorization,\nand tracking operations in the POS system.\n\nAuthentication is required via token or API key. The tenant ID in the path must match\nthe one in the security credentials.": "新しいスタッフレコードを作成します。スタッフメンバーをシステムに追加します。",
    "Retrieve all staff records for a tenant.\n\nThis endpoint returns a paginated list of all staff members for the specified tenant.\nThe results can be sorted and paginated as needed. This is useful for getting a list\nof all available staff members for administration or selection purposes.\n\nAuthentication is required via token or API key. The tenant ID in the path must match\nthe one in the security credentials.": "スタッフ情報を取得します。スタッフメンバーの詳細を返します。",
    "Retrieve a specific staff record by their ID.\n\nThis endpoint retrieves the details of a staff member identified by their unique ID.\nIt returns information including name, roles, and other attributes (PIN is not returned).\n\nAuthentication is required via token or API key. The tenant ID in the path must match\nthe one in the security credentials.": "スタッフ情報を取得します。スタッフメンバーの詳細を返します。",
    "Update an existing staff record.\n\nThis endpoint allows updating the details of an existing staff member identified by their ID.\nOnly the provided fields will be updated. This can be used to change a staff member's name,\nPIN code, or assigned roles.\n\nAuthentication is required via token or API key. The tenant ID in the path must match\nthe one in the security credentials.": "Update Staff Master Asyncを更新します。",
    "Delete a staff record.\n\nThis endpoint allows deleting a staff member from the system. This operation\nis permanent and cannot be undone. Once a staff member is deleted, they will no\nlonger be able to log in or access the POS system.\n\nAuthentication is required via token or API key. The tenant ID in the path must match\nthe one in the security credentials.": "Delete Staff Master Asyncを削除します。対象をシステムから削除します。",
    "Create a new item master record.\n\nThis endpoint allows creating a new item with common attributes like code,\ndescription, price, cost, and category. These items are tenant-specific and\ncan be used across all stores within the tenant.\n\nAuthentication is required via token or API key. The tenant ID in the path must match\nthe one in the security credentials.": "新しい商品マスターレコードを作成します。商品をカタログに追加します。",
    "Retrieve all item master records for a tenant.\n\nThis endpoint returns a paginated list of all active items for the specified tenant.\nThe results can be sorted and paginated as needed. Optionally filter by category code.\n\nAuthentication is required via token or API key. The tenant ID in the path must match\nthe one in the security credentials.": "商品を取得します。商品の詳細情報を返します。",
    "Retrieve a specific item master record by its code.\n\nThis endpoint retrieves the details of an item identified by its unique code.\nBy default, it only returns active items, but setting is_logical_deleted to true\nallows retrieving logically deleted items as well.\n\nAuthentication is required via token or API key. The tenant ID in the path must match\nthe one in the security credentials.": "商品を取得します。商品の詳細情報を返します。",
    "Update an existing item master record.\n\nThis endpoint allows updating the details of an existing item identified by its code.\nOnly the provided fields will be updated, and the item_code cannot be changed.\n\nAuthentication is required via token or API key. The tenant ID in the path must match\nthe one in the security credentials.": "Update Item Master Asyncを更新します。",
    "Delete an item master record.\n\nThis endpoint allows deleting an item either logically or physically.\nLogical deletion marks the item as deleted but keeps it in the database,\nwhile physical deletion completely removes it from the database.\n\nAuthentication is required via token or API key. The tenant ID in the path must match\nthe one in the security credentials.": "Delete Item Master Asyncを削除します。対象をシステムから削除します。",
    "Create a new store-specific item master record.\n\nThis endpoint allows creating store-specific information for an existing common item.\nStore-specific details typically include a store-specific price that may differ\nfrom the default price defined in the common item master.\n\nThis allows individual stores within a tenant to have unique pricing for the same items.\nThe item must already exist in the common item master before store-specific data can be added.\n\nAuthentication is required via token or API key. The tenant ID in the path must match\nthe one in the security credentials.": "新しい商品マスターレコードを作成します。商品をカタログに追加します。",
    "Retrieve all store-specific item records for a specific store.\n\nThis endpoint returns a paginated list of all store-specific item data for\nthe specified store. The results can be sorted and paginated as needed.\nThis is useful for getting a list of all items with store-specific prices\nor other overrides.\n\nAuthentication is required via token or API key. The tenant ID in the path must match\nthe one in the security credentials.": "店舗情報を取得します。店舗の詳細と設定を返します。",
    "Retrieve a specific store-specific item record by its code.\n\nThis endpoint retrieves the store-specific details of an item identified by its unique code.\nThis provides only the store-specific information like price overrides, not the complete\nitem details from the common master.\n\nAuthentication is required via token or API key. The tenant ID in the path must match\nthe one in the security credentials.": "店舗情報を取得します。店舗の詳細と設定を返します。",
    "Update an existing store-specific item record.\n\nThis endpoint allows updating the store-specific details of an item identified\nby its code. It can be used to modify the store-specific price override.\n\nAuthentication is required via token or API key. The tenant ID in the path must match\nthe one in the security credentials.": "Update Item Store Master Asyncを更新します。",
    "Delete a store-specific item record.\n\nThis endpoint allows removing store-specific item data completely from the system.\nThis does not delete the item from the common item master, only the store-specific\noverrides. After deletion, the store will use the default values from the common\nitem master.\n\nAuthentication is required via token or API key. The tenant ID in the path must match\nthe one in the security credentials.": "Delete Item Store Master Asyncを削除します。対象をシステムから削除します。",
    "Retrieve detailed item information combining common and store-specific data.\n\nThis endpoint provides a comprehensive view of an item by combining the\ncommon item data (from item_common_master) with any store-specific overrides\n(from item_store_master). This is particularly useful for POS terminals\nthat need complete item information including both common attributes and\nany store-specific pricing.\n\nAuthentication is required via token or API key. The tenant ID in the path must match\nthe one in the security credentials.": "店舗情報を取得します。店舗の詳細と設定を返します。",
    "Create a new item book record.\n\nThis endpoint allows creating a new item book with its details including title and categories.\nAuthentication is required via token or API key. The tenant ID in the path must match\nthe one in the security credentials.": "新しい商品ブックを作成します。商品ブックはPOSでの素早いアクセスのために商品を整理します。",
    "Retrieve all item book records for a tenant.\n\nThis endpoint returns a paginated list of item book records for the specified tenant.\nAuthentication is required via token or API key. The tenant ID in the path must match\nthe one in the security credentials.": "商品ブックを取得します。商品ブックの情報を返します。",
    "Retrieve an item book record by its ID.\n\nThis endpoint retrieves the details of an item book identified by its unique ID.\nAuthentication is required via token or API key. The tenant ID in the path must match\nthe one in the security credentials.": "商品ブックを取得します。商品ブックの情報を返します。",
    "Update an existing item book record.\n\nThis endpoint allows updating the details of an existing item book identified\nby its ID. Authentication is required via token or API key. The tenant ID in the path must match\nthe one in the security credentials.": "Update Item Bookを更新します。",
    "Delete an item book record.\n\nThis endpoint allows removing an item book identified by its unique ID.\nAuthentication is required via token or API key. The tenant ID in the path must match\nthe one in the security credentials.": "Delete Item Bookを削除します。対象をシステムから削除します。",
    "Retrieve detailed information of an item book by its ID.\n\nThis endpoint retrieves detailed information of an item book identified by its unique ID.\nAuthentication is required via token or API key. The tenant ID in the path must match\nthe one in the security credentials.": "商品ブックを取得します。商品ブックの情報を返します。",
    "Add a category to an item book.\n\nThis endpoint allows adding a new category to an existing item book identified by its ID.\nAuthentication is required via token or API key. The tenant ID in the path must match\nthe one in the security credentials.": "商品ブックにカテゴリを追加します。",
    "Update a category in an item book.\n\nThis endpoint allows updating an existing category in an item book identified by its ID and category number.\nAuthentication is required via token or API key. The tenant ID in the path must match\nthe one in the security credentials.": "Update Category In Item Bookを更新します。",
    "Delete a category from an item book.\n\nThis endpoint allows removing a category from an item book identified by its ID and category number.\nAuthentication is required via token or API key. The tenant ID in the path must match\nthe one in the security credentials.": "Delete Category From Item Bookを削除します。対象をシステムから削除します。",
    "Add a tab to a category in an item book.\n\nThis endpoint allows adding a new tab to an existing category in an item book identified by its ID and category number.\nAuthentication is required via token or API key. The tenant ID in the path must match\nthe one in the security credentials.": "商品ブックにカテゴリを追加します。",
    "Update a tab in a category in an item book.\n\nThis endpoint allows updating an existing tab in a category in an item book identified by its ID, category number, and tab number.\nAuthentication is required via token or API key. The tenant ID in the path must match\nthe one in the security credentials.": "Update Tab In Category In Item Bookを更新します。",
    "Delete a tab from a category in an item book.\n\nThis endpoint allows removing a tab from a category in an item book identified by its ID, category number, and tab number.\nAuthentication is required via token or API key. The tenant ID in the path must match\nthe one in the security credentials.": "Delete Tab From Category In Item Bookを削除します。対象をシステムから削除します。",
    "Add a button to a tab in a category in an item book.\n\nThis endpoint allows adding a new button to an existing tab in a category in an item book identified by its ID, category number, and tab number.\nAuthentication is required via token or API key. The tenant ID in the path must match\nthe one in the security credentials.": "商品ブックにカテゴリを追加します。",
    "Update a button in a tab in a category in an item book.\n\nThis endpoint allows updating an existing button in a tab in a category in an item book identified by its ID, category number, tab number, and button position.\nAuthentication is required via token or API key. The tenant ID in the path must match\nthe one in the security credentials.": "Update Button In Tab In Category In Item Bookを更新します。",
    "Delete a button from a tab in a category in an item book.\n\nThis endpoint allows removing a button from a tab in a category in an item book identified by its ID, category number, tab number, and button position.\nAuthentication is required via token or API key. The tenant ID in the path must match\nthe one in the security credentials.": "Delete Button From Tab In Category In Item Bookを削除します。対象をシステムから削除します。",
    "Create a new payment method record.\n\nThis endpoint allows creating a new payment method with its code, description,\nand various flags that control its behavior in the POS system such as whether\nit can handle refunds, allow deposits over the amount, give change, etc.\n\nPayment methods are essential for transaction processing and define how sales\nare settled in the POS system (cash, credit card, gift card, etc.).\n\nAuthentication is required via token or API key. The tenant ID in the path must match\nthe one in the security credentials.": "新しい支払方法を作成します。支払オプションをシステムに追加します。",
    "Retrieve all payment methods for a tenant.\n\nThis endpoint returns a paginated list of all payment methods for the specified tenant.\nThe results can be sorted and paginated as needed. This is typically used to populate\npayment method selection screens or to view all available payment methods for administration.\n\nAuthentication is required via token or API key. The tenant ID in the path must match\nthe one in the security credentials.": "支払方法を取得します。支払方法の設定を返します。",
    "Retrieve a specific payment method by its code.\n\nThis endpoint retrieves the details of a payment method identified by its unique code.\nIt returns all attributes of the payment method including its description and behavior flags.\n\nAuthentication is required via token or API key. The tenant ID in the path must match\nthe one in the security credentials.": "支払方法を取得します。支払方法の設定を返します。",
    "Update an existing payment method.\n\nThis endpoint allows updating the details of an existing payment method identified\nby its code. It can be used to modify the description, limit amount, or behavior flags\nsuch as whether the payment method can be used for refunds or allows giving change.\n\nThe payment_code itself cannot be changed, as it serves as a unique identifier.\n\nAuthentication is required via token or API key. The tenant ID in the path must match\nthe one in the security credentials.": "Update Paymentを更新します。",
    "Delete a payment method.\n\nThis endpoint allows removing a payment method completely from the system.\nCaution should be exercised as deleting payment methods that were used in\npast transactions can cause reporting and analysis issues.\n\nIt's generally recommended to deactivate payment methods (setting is_active to false)\nrather than deleting them if they have been used in transactions.\n\nAuthentication is required via token or API key. The tenant ID in the path must match\nthe one in the security credentials.": "Delete Paymentを削除します。対象をシステムから削除します。",
    "Create a new system settings record.\n\nThis endpoint allows creating a new settings entry with a name, default value,\nand specific values for different store/terminal combinations. System settings\ncontrol the behavior of various aspects of the POS system.\n\nEach settings entry can have different values for different stores or terminals,\nallowing for fine-grained configuration of the system behavior.\n\nAuthentication is required via token or API key. The tenant ID in the path must match\nthe one in the security credentials.": "新しい設定エントリを作成します。設定項目をシステムに追加します。",
    "Retrieve all system settings for a tenant.\n\nThis endpoint returns a paginated list of all settings for the specified tenant.\nThe results can be sorted and paginated as needed. This is typically used by\nadministrative interfaces to view and manage all system settings.\n\nAuthentication is required via token or API key. The tenant ID in the path must match\nthe one in the security credentials.": "設定を取得します。設定の値と構成を返します。",
    "Retrieve a specific system setting by its name.\n\nThis endpoint retrieves the details of a setting identified by its unique name.\nIt returns the complete setting information including default value and all specific\nvalues configured for different store/terminal combinations.\n\nAuthentication is required via token or API key. The tenant ID in the path must match\nthe one in the security credentials.": "設定を取得します。設定の値と構成を返します。",
    "Update an existing system setting.\n\nThis endpoint allows updating the default value and specific values of an existing setting.\nIt can be used to modify the behavior of the system without requiring code changes.\n\nAuthentication is required via token or API key. The tenant ID in the path must match\nthe one in the security credentials.": "Update Settings Master Asyncを更新します。",
    "Delete a system setting.\n\nThis endpoint allows removing a setting completely from the system.\nCaution should be exercised as removing critical settings may cause\nsystem malfunctions if the code expects those settings to exist.\n\nAuthentication is required via token or API key. The tenant ID in the path must match\nthe one in the security credentials.": "Delete Settings Master Asyncを削除します。対象をシステムから削除します。",
    "Retrieve the effective value of a setting for a specific store and terminal.\n\nThis endpoint is critical for runtime configuration, as it resolves the effective\nvalue of a setting for a specific store/terminal combination. It first looks for\na value specific to the store and terminal, then for a store-wide value, and finally\nfalls back to the default value.\n\nThis is typically used by the POS terminals to get their configuration values at startup\nor when refreshing settings.\n\nAuthentication is required via token or API key. The tenant ID in the path must match\nthe one in the security credentials.": "設定を取得します。設定の値と構成を返します。",
    "Create a new product category record.\n\nThis endpoint allows creating a new category with its code, description,\nshort description, and associated tax code. Categories are used to organize\nproducts and can have implications for tax calculations.\n\nCategories provide a hierarchical structure for products in the POS system,\nmaking it easier to organize and find items during sales operations.\n\nAuthentication is required via token or API key. The tenant ID in the path must match\nthe one in the security credentials.": "新しいカテゴリを作成します。商品を整理するためのカテゴリを追加します。",
    "Retrieve all product categories for a tenant.\n\nThis endpoint returns a paginated list of all categories for the specified tenant.\nThe results can be sorted and paginated as needed. This is typically used to populate\ncategory selection screens or to view all available categories for administration.\n\nAuthentication is required via token or API key. The tenant ID in the path must match\nthe one in the security credentials.": "Get Categoriesの情報を取得します。",
    "Retrieve a specific product category by its code.\n\nThis endpoint retrieves the details of a category identified by its unique code.\nIt returns all attributes of the category including its description and tax code.\n\nAuthentication is required via token or API key. The tenant ID in the path must match\nthe one in the security credentials.": "カテゴリを取得します。カテゴリの詳細を返します。",
    "Update an existing product category.\n\nThis endpoint allows updating the details of an existing category identified\nby its code. It can be used to modify the description, short description, or tax code.\n\nThe category_code itself cannot be changed, as it serves as a unique identifier.\nUpdating a category will affect all products assigned to this category.\n\nAuthentication is required via token or API key. The tenant ID in the path must match\nthe one in the security credentials.": "Update Categoryを更新します。",
    "Delete a product category.\n\nThis endpoint allows removing a category completely from the system.\nCaution should be exercised as deleting categories that have products assigned\nto them may cause inconsistencies in the data. It's recommended to reassign\nproducts to other categories before deleting a category.\n\nAuthentication is required via token or API key. The tenant ID in the path must match\nthe one in the security credentials.": "Delete Categoryを削除します。対象をシステムから削除します。",
    "Retrieve all tax records for a tenant.\n\nThis endpoint returns a paginated list of all tax rates for the specified tenant.\nThe results can be sorted and paginated as needed. This is useful for getting a list\nof all available tax rates for administration or selection purposes.\n\nAuthentication is required via token or API key. The tenant ID in the path must match\nthe one in the security credentials.": "税率を取得します。税率の設定を返します。",
    "Retrieve a specific tax record by its code.\n\nThis endpoint retrieves the details of a tax rate identified by its unique code.\nIt returns information including the description, rate value, and tax type.\n\nAuthentication is required via token or API key. The tenant ID in the path must match\nthe one in the security credentials.": "税率を取得します。税率の設定を返します。",
    "Root endpoint that returns a welcome message.\n\nThis endpoint serves as a simple health check to verify that the service is running\nand responding to requests. It can be used by monitoring tools or load balancers\nto determine if the service is available.": "ルートエンドポイントです。ウェルカムメッセージとAPI情報を返します。",
    "Get a report for the entire store.\n\nThis endpoint requires either a JWT token or an API key with terminal_id.\nIt provides different types of reports (sales, category, item) at different\nscopes (flash, daily) for the specified store.": "店舗情報を取得します。店舗の詳細と設定を返します。",
    "Get a report for a specific terminal.\n\nThis endpoint requires either a JWT token or an API key with terminal_id.\nIt provides different types of reports (sales, category, item) at different\nscopes (flush, daily) for the specified terminal.": "端末情報を取得します。端末の詳細と現在の状態を返します。",
    "Handle transaction logs received via Dapr pub/sub.\n\nThis endpoint is called by Dapr when a transaction log message is published\nto the 'topic-tranlog' topic in the 'pubsub-tranlog-report' component.": "取引ログを処理します。Dapr pub/sub経由で受信した取引ログイベントを処理します。",
    "Handle cash in/out logs received via Dapr pub/sub.\n\nThis endpoint is called by Dapr when a cash log message is published\nto the 'topic-cashlog' topic in the 'pubsub-cashlog-report' component.": "入出金ログを処理します。Dapr pub/sub経由で受信した入出金イベントを処理します。",
    "Handle terminal open/close logs received via Dapr pub/sub.\n\nThis endpoint is called by Dapr when an open/close log message is published\nto the 'topic-opencloselog' topic in the 'pubsub-opencloselog-report' component.": "開閉店ログを処理します。Dapr pub/sub経由で受信した端末状態変更イベントを処理します。",
    "Direct API endpoint for receiving transaction data.\n\nThis endpoint can be used as an alternative to the Dapr pub/sub mechanism\nwhen direct REST API calls are preferred. It requires authentication via\ntoken or API key.": "取引データを受信します。カートサービスからの取引データを処理します。",
    "Create and set up a new tenant in the report service.\n\nThis endpoint initializes the database for a new tenant by creating all required\ncollections, indexes, and other necessary structures. It is typically called during\ntenant onboarding after the tenant has been created in the account service.\n\nAuthentication is required and the authenticated user must belong to the tenant\nbeing created. This ensures only authorized users can set up tenant resources.": "新しいテナントを作成します。必要なデータベースコレクションとインデックスをセットアップします。",
    "Define Dapr pub/sub subscriptions for this service.\n\nThis endpoint is called by Dapr during startup to determine which pub/sub topics\nthis service should subscribe to. When a message is published to one of these topics,\nDapr will deliver it to the specified route.": "Dapr pub/subサブスクリプションを定義します。このサービスがサブスクライブするトピックを設定します。",
    "Get all stock items for a store with pagination": "店舗情報を取得します。店舗の詳細と設定を返します。",
    "Get items with stock below minimum quantity": "商品を取得します。商品の詳細情報を返します。",
    "Create a snapshot of current stock levels": "在庫スナップショットを作成します。監査用の特定時点の在庫記録を提供します。",
    "Get list of stock snapshots with flexible date range filtering and period shortcuts": "在庫情報を取得します。在庫レベルと関連データを返します。",
    "Get a specific stock snapshot by its ID": "在庫情報を取得します。在庫レベルと関連データを返します。",
    "Get items with stock at or below reorder point": "商品を取得します。商品の詳細情報を返します。",
    "Get current stock information for a specific item": "商品を取得します。商品の詳細情報を返します。",
    "Update stock quantity for an item and record the update": "数量を更新します。指定された明細の数量を変更します。",
    "Get stock update history for an item with date range and type filtering": "在庫情報を取得します。在庫レベルと関連データを返します。",
    "Set minimum stock quantity for alerts": "最小在庫数を設定します。在庫僅少アラートの閾値を設定します。",
    "Set reorder point and quantity for an item": "発注点パラメータを設定します。発注点と発注数量を設定します。",
    "Process transaction log to update stock quantities": "Handle transaction log from cart serviceを処理します。",
    "Get the snapshot schedule configuration for a tenant": "在庫情報を取得します。在庫レベルと関連データを返します。",
    "Update the snapshot schedule configuration for a tenant": "スナップショットスケジュールを更新します。自動スナップショットの作成タイミングを設定します。",
    "Delete the snapshot schedule configuration for a tenant (reverts to defaults)": "スナップショットスケジュールを削除します。自動スナップショット作成を無効化します。",
    "Create and set up a new tenant in the stock service.\n\nThis endpoint initializes the database for a new tenant by creating all required\ncollections, indexes, and other necessary structures. It is typically called during\ntenant onboarding after the tenant has been created in the account service.\n\nAuthentication is required and the authenticated user must belong to the tenant\nbeing created. This ensures only authorized users can set up tenant resources.": "新しいテナントを作成します。必要なデータベースコレクションとインデックスをセットアップします。",
    "Create a new tenant\n\nThis endpoint sets up a new tenant in the system by:\n1. Creating necessary database structures for the Terminal service\n2. Initializing other services (Master Data, Cart, Report, Journal) for the tenant\n3. Creating the tenant information record\n\nThis operation requires OAuth2 token authentication.": "新しいテナントを作成します。必要なデータベースコレクションとインデックスをセットアップします。",
    "Get tenant information\n\nThis endpoint retrieves detailed information about a specific tenant.\nThis operation can be authenticated using either:\n- OAuth2 token, or\n- Terminal ID + API key combination": "テナント情報を取得します。テナントの設定を返します。",
    "Update tenant information\n\nThis endpoint updates the details of a specific tenant.\nThis operation requires OAuth2 token authentication.": "Update Tenantを更新します。",
    "Delete a tenant\n\nThis endpoint deletes a tenant from the system.\nThis operation requires OAuth2 token authentication.": "Delete Tenantを削除します。対象をシステムから削除します。",
    "Add a store to a tenant\n\nThis endpoint adds a new store to the specified tenant.\nThis operation requires OAuth2 token authentication.": "店舗を追加します。テナントに新しい店舗を追加します。",
    "Get a list of stores for a tenant\n\nThis endpoint retrieves a paginated list of stores for the specified tenant.\nThis operation can be authenticated using either:\n- OAuth2 token, or\n- Terminal ID + API key combination": "店舗情報を取得します。店舗の詳細と設定を返します。",
    "Get store information\n\nThis endpoint retrieves detailed information about a specific store.\nThis operation can be authenticated using either:\n- OAuth2 token, or\n- Terminal ID + API key combination": "店舗情報を取得します。店舗の詳細と設定を返します。",
    "Update store information\n\nThis endpoint updates the details of a specific store.\nThis operation requires OAuth2 token authentication.": "Update Storeを更新します。",
    "Delete a store\n\nThis endpoint deletes a store from the specified tenant.\nThis operation requires OAuth2 token authentication.": "Delete Storeを削除します。対象をシステムから削除します。",
    "Create a new terminal\n\nThis endpoint creates a new terminal for a store with the provided details.\nRequires token authentication (no terminal ID/API key needed since the terminal doesn't exist yet).": "新しい端末を作成します。店舗にPOS端末を登録します。",
    "Get a list of terminals\n\nThis endpoint retrieves a paginated list of terminals for the authenticated tenant.\nOptional filtering by store code is supported.": "端末情報を取得します。端末の詳細と現在の状態を返します。",
    "Get terminal information\n\nThis endpoint retrieves detailed information about a specific terminal.": "端末情報を取得します。端末の詳細と現在の状態を返します。",
    "Delete a terminal\n\nThis endpoint deletes a terminal from the system.\nRequires OAuth2 token authentication.": "Delete Terminalを削除します。対象をシステムから削除します。",
    "Update terminal description\n\nThis endpoint updates the description of a specific terminal.": "端末の説明を更新します。端末の表示名やメモを変更します。",
    "Update terminal function mode\n\nThis endpoint updates the operating mode of a terminal (e.g., Sales, Returns, etc.).\nThe function mode determines what operations are available on the terminal.": "端末の機能モードを更新します。操作モードを変更します。",
    "Sign in to a terminal\n\nThis endpoint associates a staff member with a terminal for the duration of their shift.\nA terminal must have a staff member signed in before most operations can be performed.": "スタッフをサインインします。端末へのスタッフサインインを記録します。",
    "Sign out from a terminal\n\nThis endpoint removes the current staff association from a terminal\nat the end of their shift or when changing operators.": "スタッフをサインアウトします。端末からのスタッフサインアウトを記録します。",
    "Open a terminal for business operations\n\nThis endpoint transitions a terminal to the 'opened' state,\nmaking it ready for sales and other business operations.\nIt also records the initial cash amount in the drawer.": "端末を開店します。新しい営業日のために端末を初期化します。",
    "Close a terminal after business operations\n\nThis endpoint transitions a terminal to the 'closed' state,\nending the current business session. It records the final\nphysical cash amount in the drawer and creates a closing report.": "端末を閉店します。その日の取引を確定し、閉店レポートを生成します。",
    "Add cash to a terminal drawer\n\nThis endpoint records cash being added to the terminal drawer\nand generates a receipt for the transaction.": "現金を入金します。端末のドロワーへの入金を記録し、レシートを生成します。",
    "Remove cash from a terminal drawer\n\nThis endpoint records cash being removed from the terminal drawer\nand generates a receipt for the transaction.": "現金を出金します。端末のドロワーからの出金を記録し、レシートを生成します。",
    "Update the delivery status of a transaction\n\nThis endpoint updates the delivery status of a transaction\nand generates a receipt for the transaction.": "配信状態を更新します。取引の配信追跡情報を更新します。",
    "Root endpoint that provides basic API information\nReturns a welcome message and supported API versions": "ルートエンドポイントです。ウェルカムメッセージとAPI情報を返します。"
  }
}